#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 9: Disk Fragmenter
#+AUTHOR: Michael R. Mauger
#+DATE: [Wed Dec 11 01:54:06 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  LOAD_FILE=example.dat sqlite3 < disk-fragmenter.sql
  LOAD_FILE=input.dat   sqlite3 < disk-fragmenter.sql
#+END_SRC

#+RESULTS:
#+begin_example

CREATE TABLE segment
(   seg_id              INT
,   start_block         INT
,   num_blocks          INT
,   file_id             INT
);
Run Time: real 0.000 user 0.000125 sys 0.000124
changes: 0   total_changes: 0

.import --csv '| awk -f load-segments.awk $LOAD_FILE' segment
UPDATE segment SET file_id = NULL WHERE file_id = -9999;
Run Time: real 0.000 user 0.000000 sys 0.000037
changes: 8   total_changes: 26
SELECT COUNT (*) FROM segment;
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 18        │
└───────────┘
Run Time: real 0.000 user 0.000000 sys 0.000022
changes: 8   total_changes: 26

CREATE TABLE file_block
AS
SELECT
    ROW_NUMBER () OVER
    (   ORDER BY
            s.start_block DESC
        ,   x.VALUE ASC
    )  AS block_seq
,   x.VALUE  AS block_id
,   s.file_id
FROM
    segment  AS s
JOIN
    generate_series (s.start_block, s.start_block + s.num_blocks - 1, 1)  AS x
WHERE
    s.file_id IS NOT NULL
;
Run Time: real 0.000 user 0.000000 sys 0.000281
changes: 8   total_changes: 26

CREATE UNIQUE INDEX file_block_uk1 ON file_block ( block_seq )
;
Run Time: real 0.000 user 0.000000 sys 0.000059
changes: 8   total_changes: 26
CREATE UNIQUE INDEX file_block_uk2 ON file_block ( block_id )
;
Run Time: real 0.000 user 0.000000 sys 0.000046
changes: 8   total_changes: 26

SELECT * FROM segment WHERE file_id IS NOT NULL ORDER BY start_block LIMIT 50;
┌────────┬─────────────┬────────────┬─────────┐
│ seg_id │ start_block │ num_blocks │ file_id │
├────────┼─────────────┼────────────┼─────────┤
│ 0      │ 0           │ 2          │ 0       │
│ 2      │ 5           │ 3          │ 1       │
│ 4      │ 11          │ 1          │ 2       │
│ 6      │ 15          │ 3          │ 3       │
│ 8      │ 19          │ 2          │ 4       │
│ 10     │ 22          │ 4          │ 5       │
│ 12     │ 27          │ 4          │ 6       │
│ 14     │ 32          │ 3          │ 7       │
│ 16     │ 36          │ 4          │ 8       │
│ 17     │ 40          │ 2          │ 9       │
└────────┴─────────────┴────────────┴─────────┘
Run Time: real 0.000 user 0.000000 sys 0.000049
changes: 8   total_changes: 26
-- SELECT * FROM file_block ORDER BY block_id LIMIT 50;

CREATE TABLE free_block
AS
SELECT
    ROW_NUMBER () OVER
    (   ORDER BY
            s.start_block ASC
        ,   x.VALUE ASC
    )  AS block_seq
,   x.VALUE  AS block_id
FROM
    segment  AS s
JOIN
    generate_series (s.start_block, s.start_block + s.num_blocks - 1, 1)  AS x
WHERE
    s.file_id IS NULL
;
Run Time: real 0.000 user 0.000145 sys 0.000000
changes: 8   total_changes: 26

CREATE UNIQUE INDEX free_block_uk1 ON free_block ( block_seq )
;
Run Time: real 0.000 user 0.000047 sys 0.000000
changes: 8   total_changes: 26
CREATE UNIQUE INDEX free_block_uk2 ON free_block ( block_id )
;
Run Time: real 0.000 user 0.000039 sys 0.000000
changes: 8   total_changes: 26

-- SELECT * FROM segment WHERE file_id IS NULL ORDER BY start_block LIMIT 50;
-- SELECT * FROM free_block ORDER BY block_id LIMIT 50;

CREATE VIEW defrag_block
AS
SELECT
    bi.block_id
,   CASE WHEN fr_s.block_id IS NULL
        THEN fb_i.file_id
        ELSE fb_s.file_id
    END  AS file_id
FROM
(   SELECT
        VALUE  AS block_id
    FROM
        generate_series
        (   0
        ,   (   SELECT
                    SUM (num_blocks) - 1
                FROM
                    segment
                WHERE
                    file_id IS NOT NULL
            )
        )
) AS bi
LEFT JOIN
    file_block  AS fb_i
    ON
        fb_i.block_id = bi.block_id
LEFT JOIN
    free_block  AS fr_s
    ON
        bi.block_id = fr_s.block_id
LEFT JOIN
    file_block  AS fb_s
    ON
        fr_s.block_seq = fb_s.block_seq
;
Run Time: real 0.001 user 0.000103 sys 0.000000
changes: 8   total_changes: 26

SELECT
    SUBSTRING (STRING_AGG (file_id, ''), 1, 80)
FROM
    defrag_block
ORDER BY
    block_id
;
┌─────────────────────────────────────────────┐
│ SUBSTRING (STRING_AGG (file_id, ''), 1, 80) │
├─────────────────────────────────────────────┤
│ '0099811188827773336446555566'              │
└─────────────────────────────────────────────┘
Run Time: real 0.000 user 0.000113 sys 0.000000
changes: 8   total_changes: 26

SELECT
    SUM (block_id * file_id)  AS "Part One: Disk Defragmenter"
FROM
    defrag_block
;
┌─────────────────────────────┐
│ Part One: Disk Defragmenter │
├─────────────────────────────┤
│ 1928                        │
└─────────────────────────────┘
Run Time: real 0.000 user 0.000074 sys 0.000000
changes: 8   total_changes: 26


.stats
Memory Used:                         111888 (max 217200) bytes
Number of Outstanding Allocations:   286 (max 377)
Number of Pcache Overflow Bytes:     43216 (max 43216) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       1384
Lookaside failures due to size:      16
Lookaside failures due to OOM:       141
Pager Heap Usage:                    39720 bytes
Page cache hits:                     82
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   6680 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            23352
Bytes sent to write():               5681
Read() system calls:                 38
Write() system calls:                31
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0

CREATE TABLE segment
(   seg_id              INT
,   start_block         INT
,   num_blocks          INT
,   file_id             INT
);
Run Time: real 0.000 user 0.000000 sys 0.000160
changes: 0   total_changes: 0

.import --csv '| awk -f load-segments.awk $LOAD_FILE' segment
UPDATE segment SET file_id = NULL WHERE file_id = -9999;
Run Time: real 0.003 user 0.003238 sys 0.000035
changes: 8996   total_changes: 27992
SELECT COUNT (*) FROM segment;
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 18996     │
└───────────┘
Run Time: real 0.000 user 0.000023 sys 0.000002
changes: 8996   total_changes: 27992

CREATE TABLE file_block
AS
SELECT
    ROW_NUMBER () OVER
    (   ORDER BY
            s.start_block DESC
        ,   x.VALUE ASC
    )  AS block_seq
,   x.VALUE  AS block_id
,   s.file_id
FROM
    segment  AS s
JOIN
    generate_series (s.start_block, s.start_block + s.num_blocks - 1, 1)  AS x
WHERE
    s.file_id IS NOT NULL
;
Run Time: real 0.054 user 0.050958 sys 0.002942
changes: 8996   total_changes: 27992

CREATE UNIQUE INDEX file_block_uk1 ON file_block ( block_seq )
;
Run Time: real 0.013 user 0.011503 sys 0.001031
changes: 8996   total_changes: 27992
CREATE UNIQUE INDEX file_block_uk2 ON file_block ( block_id )
;
Run Time: real 0.013 user 0.011687 sys 0.000976
changes: 8996   total_changes: 27992

SELECT * FROM segment WHERE file_id IS NOT NULL ORDER BY start_block LIMIT 50;
┌────────┬─────────────┬────────────┬─────────┐
│ seg_id │ start_block │ num_blocks │ file_id │
├────────┼─────────────┼────────────┼─────────┤
│ 0      │ 0           │ 9          │ 0       │
│ 2      │ 15          │ 3          │ 1       │
│ 4      │ 24          │ 1          │ 2       │
│ 6      │ 29          │ 8          │ 3       │
│ 8      │ 42          │ 4          │ 4       │
│ 10     │ 48          │ 7          │ 5       │
│ 12     │ 63          │ 7          │ 6       │
│ 14     │ 79          │ 8          │ 7       │
│ 16     │ 96          │ 5          │ 8       │
│ 18     │ 110         │ 2          │ 9       │
│ 20     │ 118         │ 6          │ 10      │
│ 22     │ 133         │ 8          │ 11      │
│ 24     │ 148         │ 2          │ 12      │
│ 26     │ 154         │ 4          │ 13      │
│ 28     │ 166         │ 2          │ 14      │
│ 30     │ 174         │ 7          │ 15      │
│ 31     │ 181         │ 8          │ 16      │
│ 33     │ 195         │ 7          │ 17      │
│ 35     │ 203         │ 9          │ 18      │
│ 37     │ 219         │ 8          │ 19      │
│ 39     │ 234         │ 9          │ 20      │
│ 41     │ 247         │ 1          │ 21      │
│ 43     │ 252         │ 9          │ 22      │
│ 45     │ 263         │ 9          │ 23      │
│ 47     │ 275         │ 3          │ 24      │
│ 49     │ 281         │ 9          │ 25      │
│ 51     │ 293         │ 9          │ 26      │
│ 53     │ 308         │ 3          │ 27      │
│ 55     │ 314         │ 2          │ 28      │
│ 57     │ 324         │ 8          │ 29      │
│ 59     │ 335         │ 4          │ 30      │
│ 60     │ 339         │ 9          │ 31      │
│ 62     │ 350         │ 1          │ 32      │
│ 64     │ 360         │ 5          │ 33      │
│ 66     │ 371         │ 4          │ 34      │
│ 68     │ 376         │ 3          │ 35      │
│ 70     │ 386         │ 8          │ 36      │
│ 72     │ 401         │ 4          │ 37      │
│ 74     │ 411         │ 4          │ 38      │
│ 76     │ 424         │ 7          │ 39      │
│ 78     │ 440         │ 7          │ 40      │
│ 80     │ 453         │ 9          │ 41      │
│ 82     │ 463         │ 5          │ 42      │
│ 84     │ 476         │ 3          │ 43      │
│ 86     │ 481         │ 3          │ 44      │
│ 88     │ 487         │ 4          │ 45      │
│ 90     │ 494         │ 4          │ 46      │
│ 92     │ 503         │ 9          │ 47      │
│ 94     │ 513         │ 9          │ 48      │
│ 96     │ 524         │ 1          │ 49      │
└────────┴─────────────┴────────────┴─────────┘
Run Time: real 0.001 user 0.001200 sys 0.000015
changes: 8996   total_changes: 27992
-- SELECT * FROM file_block ORDER BY block_id LIMIT 50;

CREATE TABLE free_block
AS
SELECT
    ROW_NUMBER () OVER
    (   ORDER BY
            s.start_block ASC
        ,   x.VALUE ASC
    )  AS block_seq
,   x.VALUE  AS block_id
FROM
    segment  AS s
JOIN
    generate_series (s.start_block, s.start_block + s.num_blocks - 1, 1)  AS x
WHERE
    s.file_id IS NULL
;
Run Time: real 0.043 user 0.042105 sys 0.001021
changes: 8996   total_changes: 27992

CREATE UNIQUE INDEX free_block_uk1 ON free_block ( block_seq )
;
Run Time: real 0.011 user 0.010544 sys 0.000000
changes: 8996   total_changes: 27992
CREATE UNIQUE INDEX free_block_uk2 ON free_block ( block_id )
;
Run Time: real 0.010 user 0.010340 sys 0.000001
changes: 8996   total_changes: 27992

-- SELECT * FROM segment WHERE file_id IS NULL ORDER BY start_block LIMIT 50;
-- SELECT * FROM free_block ORDER BY block_id LIMIT 50;

CREATE VIEW defrag_block
AS
SELECT
    bi.block_id
,   CASE WHEN fr_s.block_id IS NULL
        THEN fb_i.file_id
        ELSE fb_s.file_id
    END  AS file_id
FROM
(   SELECT
        VALUE  AS block_id
    FROM
        generate_series
        (   0
        ,   (   SELECT
                    SUM (num_blocks) - 1
                FROM
                    segment
                WHERE
                    file_id IS NOT NULL
            )
        )
) AS bi
LEFT JOIN
    file_block  AS fb_i
    ON
        fb_i.block_id = bi.block_id
LEFT JOIN
    free_block  AS fr_s
    ON
        bi.block_id = fr_s.block_id
LEFT JOIN
    file_block  AS fb_s
    ON
        fr_s.block_seq = fb_s.block_seq
;
Run Time: real 0.000 user 0.000112 sys 0.000000
changes: 8996   total_changes: 27992

SELECT
    SUBSTRING (STRING_AGG (file_id, ''), 1, 80)
FROM
    defrag_block
ORDER BY
    block_id
;
┌──────────────────────────────────────────────────────────────┐
│         SUBSTRING (STRING_AGG (file_id, ''), 1, 80)          │
├──────────────────────────────────────────────────────────────┤
│ '00000000099999999999999999999999911199999998999899989997999 │
│ 729997999799979996333'                                       │
└──────────────────────────────────────────────────────────────┘
Run Time: real 0.039 user 0.038595 sys 0.000000
changes: 8996   total_changes: 27992

SELECT
    SUM (block_id * file_id)  AS "Part One: Disk Defragmenter"
FROM
    defrag_block
;
┌─────────────────────────────┐
│ Part One: Disk Defragmenter │
├─────────────────────────────┤
│ 6360094256423               │
└─────────────────────────────┘
Run Time: real 0.037 user 0.036499 sys 0.000000
changes: 8996   total_changes: 27992


.stats
Memory Used:                         4222720 (max 6290096) bytes
Number of Outstanding Allocations:   1224 (max 1315)
Number of Pcache Overflow Bytes:     4147904 (max 4152008) bytes
Largest Allocation:                  2048000 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       115251
Lookaside failures due to size:      17
Lookaside failures due to OOM:       141
Pager Heap Usage:                    4121896 bytes
Page cache hits:                     319289
Page cache misses:                   0
Page cache writes:                   0
Page cache spills:                   0
Schema Heap Usage:                   6680 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            398910
Bytes sent to write():               363622
Read() system calls:                 128
Write() system calls:                117
Bytes read from storage:             0
Bytes written to storage:            0
Cancelled write bytes:               0
#+end_example
